Model: "conv9scifar"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 32, 32, 3)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 32)        896       
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 32)        128       
_________________________________________________________________
activation (Activation)      (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        9248      
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 32, 32, 48)        13872     
_________________________________________________________________
activation_3 (Activation)    (None, 32, 32, 48)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 32, 32, 48)        20784     
_________________________________________________________________
activation_4 (Activation)    (None, 32, 32, 48)        0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 16, 16, 48)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 16, 16, 48)        0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 16, 16, 80)        34640     
_________________________________________________________________
activation_5 (Activation)    (None, 16, 16, 80)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 16, 16, 80)        57680     
_________________________________________________________________
activation_6 (Activation)    (None, 16, 16, 80)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 16, 16, 80)        57680     
_________________________________________________________________
activation_7 (Activation)    (None, 16, 16, 80)        0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 16, 16, 80)        57680     
_________________________________________________________________
activation_8 (Activation)    (None, 16, 16, 80)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 8, 8, 80)          0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 8, 80)          0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 128)         92288     
_________________________________________________________________
activation_9 (Activation)    (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_10 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_11 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_12 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
global_max_pooling2d (Global (None, 128)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 640)               82560     
_________________________________________________________________
activation_13 (Activation)   (None, 640)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 10)                6410      
_________________________________________________________________
activation_14 (Activation)   (None, 10)                0         
=================================================================
Total params: 885,866
Trainable params: 885,802
Non-trainable params: 64